# PlacementParamsShow Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PlacementParamsShow Property
ParameterTypeId Class See Also
---
"Enable Position Parameters"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PlacementParamsShow { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PlacementParamsShow As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PlacementParamsShow {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace